In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series (data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [9]:
ser1= pd.Series([1,2,3,4],['USA','Germany','England','Japan'])

In [10]:
ser1

USA        1
Germany    2
England    3
Japan      4
dtype: int64

In [12]:
ser2= pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [13]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
ser1+ser2

England    NaN
Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
dtype: float64

## DataFrames

In [15]:
from numpy.random import randn

In [16]:
np.random.seed(101)

In [17]:
df=pd.DataFrame(randn (5,4),['a','b','c','d','e'],['W','X','Y','Z'])

In [18]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [19]:
df['W']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: W, dtype: float64

In [20]:
type(df['W'])

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

In [27]:
df[['W','Z']]

          W         Z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [28]:
df['new']=df['W']+df['W']

In [29]:
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  5.413700
b  0.651118 -0.319318 -0.848077  0.605965  1.302236
c -2.018168  0.740122  0.528813 -0.589001 -4.036336
d  0.188695 -0.758872 -0.933237  0.955057  0.377391
e  0.190794  1.978757  2.605967  0.683509  0.381589

In [30]:
df.loc['a']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    5.413700
Name: a, dtype: float64

In [31]:
df.iloc[1]

W      0.651118
X     -0.319318
Y     -0.848077
Z      0.605965
new    1.302236
Name: b, dtype: float64

In [33]:
df.drop('new',axis=1)

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [34]:
df.drop("a")

          W         X         Y         Z       new
b  0.651118 -0.319318 -0.848077  0.605965  1.302236
c -2.018168  0.740122  0.528813 -0.589001 -4.036336
d  0.188695 -0.758872 -0.933237  0.955057  0.377391
e  0.190794  1.978757  2.605967  0.683509  0.381589

In [35]:
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  5.413700
b  0.651118 -0.319318 -0.848077  0.605965  1.302236
c -2.018168  0.740122  0.528813 -0.589001 -4.036336
d  0.188695 -0.758872 -0.933237  0.955057  0.377391
e  0.190794  1.978757  2.605967  0.683509  0.381589

In [36]:
df.drop('new',axis=1,inplace=True)

In [37]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [39]:
df.loc['a']['W']

2.706849839399938

In [42]:
df.loc['c','Z']

-0.5890005332865824

In [43]:
df<0

       W      X      Y      Z
a  False  False  False  False
b  False   True   True  False
c   True  False  False   True
d  False   True   True  False
e  False  False  False  False

In [44]:
df[df<0]

          W         X         Y         Z
a       NaN       NaN       NaN       NaN
b       NaN -0.319318 -0.848077       NaN
c -2.018168       NaN       NaN -0.589001
d       NaN -0.758872 -0.933237       NaN
e       NaN       NaN       NaN       NaN

In [46]:
df[df['X']>0]

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
c -2.018168  0.740122  0.528813 -0.589001
e  0.190794  1.978757  2.605967  0.683509

In [47]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [49]:
df.reset_index()

  index         W         X         Y         Z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [50]:
yl=['i','k','m','n','f']

In [51]:
df['Yeni index']=yl

In [52]:
df

          W         X         Y         Z Yeni index
a  2.706850  0.628133  0.907969  0.503826          i
b  0.651118 -0.319318 -0.848077  0.605965          k
c -2.018168  0.740122  0.528813 -0.589001          m
d  0.188695 -0.758872 -0.933237  0.955057          n
e  0.190794  1.978757  2.605967  0.683509          f

In [53]:
df.set_index("Yeni index")

                   W         X         Y         Z
Yeni index
i           2.706850  0.628133  0.907969  0.503826
k           0.651118 -0.319318 -0.848077  0.605965
m          -2.018168  0.740122  0.528813 -0.589001
n           0.188695 -0.758872 -0.933237  0.955057
f           0.190794  1.978757  2.605967  0.683509

In [54]:
df

          W         X         Y         Z Yeni index
a  2.706850  0.628133  0.907969  0.503826          i
b  0.651118 -0.319318 -0.848077  0.605965          k
c -2.018168  0.740122  0.528813 -0.589001          m
d  0.188695 -0.758872 -0.933237  0.955057          n
e  0.190794  1.978757  2.605967  0.683509          f

In [56]:
df.set_index("Yeni index", inplace=True)

In [57]:
df

                   W         X         Y         Z
Yeni index
i           2.706850  0.628133  0.907969  0.503826
k           0.651118 -0.319318 -0.848077  0.605965
m          -2.018168  0.740122  0.528813 -0.589001
n           0.188695 -0.758872 -0.933237  0.955057
f           0.190794  1.978757  2.605967  0.683509

In [58]:
df.loc["f"]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: f, dtype: float64

In [59]:
ilkIndexler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [60]:
icIndexler=["Homer","Bart","Merge","Cartman","Kenny","Kyle"]

In [61]:
birlesmisIndex=list(zip(ilkIndexler,icIndexler))

In [62]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Merge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [63]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [64]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Merge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [65]:
cfl=[[40,"A"],[10,"e"],[20,"u"],[8,"s"],[22,"d"],[12,"v"]]

In [66]:
npydizi=np.array(cfl)

In [67]:
cdf=pd.DataFrame(npydizi,birlesmisIndex,columns=["Yas","Meslek"])

In [68]:
cdf

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      e
           Merge    20      u
South Park Cartman   8      s
           Kenny    22      d
           Kyle     12      v

In [69]:
cdf.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      e
Merge  20      u

In [70]:
cdf.loc["South Park"].loc["Kenny"]

Yas       22
Meslek     d
Name: Kenny, dtype: object